//================================================================================================================
//
// DirectXのモード変更のcppファイル [mode.cpp]
// Author : TENMA
//
//================================================================================================================
//*************************************************************************************************
//*** インクルードファイル ***
//*************************************************************************************************
#include "mode.h"
#include "edit.h"

//*************************************************************************************************
//*** マクロ定義 ***
//*************************************************************************************************

//**********************************************************************************
//*** プロトタイプ宣言 ***
//**********************************************************************************

//**********************************************************************************
//*** グローバル変数 ***
//**********************************************************************************
MODE g_mode = MODE_EDIT;								// 現在の画面

//==================================================================================
// --- タイトル関連cppファイルの初期化 ---
//==================================================================================
void InitMode(int nThreadNum)
{
	
}

//==================================================================================
// --- タイトル関連cppファイルの終了 ---
//==================================================================================
void UninitMode(int nThreadNum)
{
	if (nThreadNum == 0)
	{
		// ゲーム画面の終了処理
		UninitEdit();
	}
	else
	{

	}
}

//==================================================================================
// --- タイトル関連cppファイルの更新 ---
//==================================================================================
void UpdateMode(int nThreadNum)
{
	if (nThreadNum == 0)
	{
		switch (g_mode)
		{
			// エディタ画面
		case MODE_EDIT:
			UpdateEdit();
			break;
		}
	}
	else
	{
		switch (g_mode)
		{
			// エディタ画面
		case MODE_EDIT:
			UpdateEdit(nThreadNum);
			break;
		}
	}
}

//==================================================================================
// --- タイトル関連cppファイルの描画 ---
//==================================================================================
void DrawMode(int nThreadNum)
{
	if (nThreadNum == 0)
	{
		// デバイスの取得
		LPDIRECT3DDEVICE9 pDevice = GetDevice();
		D3DVIEWPORT9 viewportDef;		// デフォルトビューポート

		// ビューポートの保存
		pDevice->GetViewport(&viewportDef);

		/*** 現在の画面(モード)の描画処理 ***/
		switch (g_mode)
		{
			// エディタ画面
		case MODE_EDIT:
			DrawEdit();
			break;
		}

		// ビューポートの設定
		pDevice->SetViewport(&viewportDef);

		EndDevice();
	}
	else
	{
		// デバイスの取得
		LPDIRECT3DDEVICE9 pDevice = GetDevicePrev();
		D3DVIEWPORT9 viewportDef;		// デフォルトビューポート

		// ビューポートの保存
		pDevice->GetViewport(&viewportDef);

		/*** 現在の画面(モード)の描画処理 ***/
		switch (g_mode)
		{
			// エディタ画面
		case MODE_EDIT:
			DrawEdit(nThreadNum);
			break;
		}

		// ビューポートの設定
		pDevice->SetViewport(&viewportDef);
	}
}

//==================================================================================
// --- 画面の設定 ---
//==================================================================================
void SetMode(MODE mode, int nThreadNum)
{
	if (nThreadNum == 0)
	{
		// 現在の画面(モード)の終了
		switch (g_mode)
		{
			// エディタ画面
		case MODE_EDIT:
			UninitEdit(0);
			break;
		}

		// 指定の画面(モード)の初期化処理
		switch (mode)
		{
			// エディタ画面
		case MODE_EDIT:
			InitEdit(0);
			break;
		}

		// モードを保存
		g_mode = mode;
	}
	else
	{
		// 現在の画面(モード)の終了
		switch (g_mode)
		{
			// エディタ画面
		case MODE_EDIT:
			UninitEdit(1);
			break;
		}

		// 指定の画面(モード)の初期化処理
		switch (mode)
		{
			// エディタ画面
		case MODE_EDIT:
			InitEdit(1);
			break;
		}

		// モードを保存
		g_mode = mode;
	}
}

//==================================================================================
// --- デバイスリセット ---
//==================================================================================
void ResetMode(bool bLost, int nThreadNum)
{
	if (nThreadNum == 0)
	{
		// 指定の画面(モード)の初期化処理
		switch (g_mode)
		{
			// エディタ画面
		case MODE_EDIT:
			ResetEdit(bLost);
			break;
		}
	}
	else
	{

	}
}

//==================================================================================
// --- 現在のモードを取得 ---
//==================================================================================
MODE GetMode(void)
{
	return g_mode;
}