//================================================================================================================
//
// DirectXのプレビューモデル表示用ヘッダファイル [prevModel.h]
// Author : TENMA
//
//================================================================================================================
#ifndef _PREVMODEL_H_
#define _PREVMODEL_H_

//**********************************************************************************
//*** インクルードファイル ***
//**********************************************************************************
#include "main.h"

//**********************************************************************************
//*** マクロ定義 ***
//**********************************************************************************

//*************************************************************************************************
//*** モデル情報構造体の定義 ***
//*************************************************************************************************
typedef struct PREVMODEL
{
	D3DXVECTOR3 pos;		// 3Dモデルの位置
	D3DXVECTOR3 rot;		// 3Dモデルの向き
	D3DXMATRIX mtxWorld;	// ワールドマトリックス
	int nIdx3Dmodel;		// モデルデータのインデックス
	bool bUse;				// 格納状況
} PREVMODEL;

typedef struct PREVMODEL *PPREVMODEL, *LPPREVMODEL;

//**********************************************************************************
//*** プロトタイプ宣言 ***
//**********************************************************************************
void InitPrevModel(void);
void UninitPrevModel(void);
void UpdatePrevModel(void);
void DrawPrevModel(void);

void SetPrevModel(D3DXVECTOR3 pos, D3DXVECTOR3 rot, int nIdxModelData);
#endif