//================================================================================================================
//
// DirectXのスカイボックスのヘッダーファイル [skybox.h]
// Author : TENMA
//
//================================================================================================================
#ifndef _SKYBOX_H_
#define _SKYBOX_H_

//**********************************************************************************
//*** インクルードファイル ***
//**********************************************************************************
#include "main.h"

//**********************************************************************************
//*** マクロ定義 ***
//**********************************************************************************
#define SKYBOX_CLOUD		"data\\TEXTURE\\CLOUD.dds"		// 曇り空
#define SKYBOX_NORMAL		"data\\TEXTURE\\Skymap5.dds"	// 晴れ空
#define SKYBOX_SPACE		"data\\TEXTURE\\Space2.dds"		// 宇宙空間
#define SKYBOX_REDMOON		"data\\TEXTURE\\RedMoon.dds"	// 赤い月

//**********************************************************************************
//*** プロトタイプ宣言 ***
//**********************************************************************************
void InitSkybox(void);
void UninitSkybox(void);
void UpdateSkybox(void);
void DrawSkybox(void);
void ResetSkybox(bool bLost);

void SetSkybox(const char *ddsFileName);
#endif
